app/views/articles/index.html.erb

        <td><%= article.text %></td>
        <td><%= article.votes.count %></td>
        <% if session[:current_user_id].is_a? Integer %>
          <% if article.votes.find_by(user_id: @user).present? %>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."article_id" = ? AND "votes"."user_id" = ? LIMIT ?  [["article_id", 1], ["user_id", 2], ["LIMIT", 1]]