app/controllers/articles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Harley Davidson"], ["text", "Testing this article"], ["created_at", "2020-05-14 15:42:28.875873"], ["updated_at", "2020-05-14 15:42:28.875873"]]
INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "I love democracy"], ["text", "I love the republic!"], ["created_at", "2020-05-14 17:01:26.536865"], ["updated_at", "2020-05-14 17:01:26.536865"], ["author_id", 2]]
---
  def create
    current_user = User.find(session[:current_user_id])
    @article = current_user.articles.build(article_params)
    @article.image.attach(params[:article][:image])

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "This is a cat"], ["updated_at", "2020-05-14 16:25:17.558785"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)