app/controllers/articles_controller.rb

  def index
    @articles = Article.all

    @categories = Category.all.sort_by{ |category| category.priority }.reverse

    if session[:current_user_id].is_a? Integer
       @user = User.find(session[:current_user_id])
    else
       @user = User.first
    end


    @main_article = @articles.sort_by{ |article| article.votes.count }.reverse.first
---
SELECT "articles".* FROM "articles"
SELECT "categories".* FROM "categories"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 1]]

  def vote
    @vote = Vote.new(vote_params)

    if @vote.save
---
INSERT INTO "votes" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["article_id", 1], ["created_at", "2020-05-14 17:26:54.187642"], ["updated_at", "2020-05-14 17:26:54.187642"]]

  def unvote
    @vote = Vote.find_by(user_id: params[:user_id], article_id: params[:article_id])
    @prev_vote = params[:article_id]

    if @vote.destroy
---
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."article_id" = ? LIMIT ?  [["user_id", 2], ["article_id", 2], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 4]]

  def collection
    @article = Article.find(params[:id])

    @collection = Article.where(category_id: @article.category_id)

    if session[:current_user_id].is_a? Integer
       @user = User.find(session[:current_user_id])
    else
       @user = User.first
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    current_user = User.find(session[:current_user_id])
    @article = current_user.articles.build(article_params)
    @article.image.attach(params[:article][:image])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "author_id", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Harley Davidson"], ["text", "A nice motorbike"], ["created_at", "2020-05-14 20:22:37.026364"], ["updated_at", "2020-05-14 20:22:37.026364"], ["author_id", 2], ["category_id", 1]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Rubykaigi 2020"], ["text", "At tokyo japan"], ["updated_at", "2020-05-15 18:13:58.898515"], ["id", 1]]