app/controllers/categories_controller.rb

INSERT INTO "votes" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["article_id", 1], ["created_at", "2020-05-22 17:45:47.855708"], ["updated_at", "2020-05-22 17:45:47.855708"]]
---
  def vote
    @vote = Vote.new(vote_params)

    if @vote.save

SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."article_id" = ? LIMIT ?  [["user_id", 1], ["article_id", 1], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 1]]
---
  def unvote
    @vote = Vote.find_by(user_id: params[:user_id], article_id: params[:article_id])
    @prev_vote = params[:article_id]

    if @vote.destroy