app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "David"], ["LIMIT", 1]]
---
  def login
    if User.find_by(name: params[:name])
      @user = User.find_by(name: params[:name])

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "David"], ["created_at", "2020-05-14 16:49:29.514078"], ["updated_at", "2020-05-14 16:49:29.514078"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(session[:current_user_id])